---
kind: property
id: P:Autodesk.Revit.DB.Material.ThermalAssetId
zh: 材质、材料
source: html/76db3e11-fdaa-14f1-58c6-6f66ed70e0bd.htm
---
# Autodesk.Revit.DB.Material.ThermalAssetId Property

**中文**: 材质、材料

The ElementId of the thermal PropertySetElement.

## Syntax (C#)
```csharp
public ElementId ThermalAssetId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null